//
//  MainNote.swift
//  day05
//
//  Created by Melania Dababi on 6/15/24.
//

import SwiftUI

struct MainNote: View {
    var body: some View {
        Text("")
    }
}

struct MainNote_Previews: PreviewProvider {
    static var previews: some View {
        MainNote()
    }
}

/*
### Задание 2. Экран списка рецептов (основной)
Реализовать компонент View для отображения списка рецептов.

- Экран списка рецептов должен отображаться при запуске приложения;
- Экран списка рецептов должен содержать список доступных рецептов;
- Данные доступных рецептов могут формироваться как из локального JSON файла так и с помощью общедоступного API;
- Выбрать API можно из [списка](https://github.com/public-apis/public-apis#food--drink);
- Способ получения данных в рамках задания не оценивается;
- Каждый элемент списка должен содержать заголовок и изображение;
- Изображение должно находиться в круглой рамке.

**Совет!** Пример локального JSON файла можно найти [здесь](./materials/example.json)
*/
